# The Movielense data 

The notebook uses data set from http://grouplens.org/datasets/movielens/ and the dataset is then explored using Python libraries like numpy, pandas etc. 

Data exploration on the dataset is motivated from CS109(Havard University's course http://cs109.github.io/2015/pages/videos.html)

## Reading user data

In [2]:
## importing python libraries
import pandas as pd
import numpy as np

In [6]:
## importing data set
user_colnames =  ['user_id', 'age', 'sex', 'occupation', 'zip_code']

user_data = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.user', sep ='|', names = user_colnames)

user_data.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

## Reading ratings data

In [7]:
ratings_colnames = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings_data = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.data', 
    sep='\t', names=ratings_colnames)

ratings_data.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

## Reading movie data

In [10]:
movies_colnames = ['movie_id', 'title', 'release_date', 
            'video_release_date', 'imdb_url']

movies_data = pd.read_csv(
    'http://files.grouplens.org/datasets/movielens/ml-100k/u.item', 
    sep='|', names=movies_colnames, usecols=range(5), encoding = "ISO-8859-1")

movies_data.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

## Exploring datasets

In [13]:
print(movies_data.dtypes)
print(movies_data.describe())

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object
          movie_id  video_release_date
count  1682.000000                 0.0
mean    841.500000                 NaN
std     485.695893                 NaN
min       1.000000                 NaN
25%     421.250000                 NaN
50%     841.500000                 NaN
75%    1261.750000                 NaN
max    1682.000000                 NaN

In [17]:
movies_data.title
movies_data['title'].head()

movie_id                                                              3
title                                                 Four Rooms (1995)
release_date                                                01-Jan-1995
video_release_date                                                  NaN
imdb_url              http://us.imdb.com/M/title-exact?Four%20Rooms%...
Name: 2, dtype: object

In [18]:
## to access rows 

movies_data.iloc[2]

movie_id                                                              3
title                                                 Four Rooms (1995)
release_date                                                01-Jan-1995
video_release_date                                                  NaN
imdb_url              http://us.imdb.com/M/title-exact?Four%20Rooms%...
Name: 2, dtype: object

In [26]:
## users with age 40 and male
user_data[user_data.age== 40 ][user_data[user_data.age== 40 ].sex=='M']

     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232
199      200   40   M  programmer    93402
283      284   40   M   executive    92629
289      290   40   M    engineer    93550
308      309   40   M   scientist    70802
357      358   40   M    educator    10022
397      398   40   M       other    60008
564      565   40   M     student    55422
646      647   40   M    educator    45810
791      792   40   M  programmer    12205
841      842   40   M      writer    93055
917      918   40   M   scientist    70116

In [34]:
## mean age of female computer programmers
user_data[user_data.occupation== 'programmer' ][user_data[user_data.occupation== 'programmer' ].sex=='F'].age.mean()

32.166666666666664

In [36]:
user_data[(user_data.age==40) & (user_data.sex=='M')]

     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232
199      200   40   M  programmer    93402
283      284   40   M   executive    92629
289      290   40   M    engineer    93550
308      309   40   M   scientist    70802
357      358   40   M    educator    10022
397      398   40   M       other    60008
564      565   40   M     student    55422
646      647   40   M    educator    45810
791      792   40   M  programmer    12205
841      842   40   M      writer    93055
917      918   40   M   scientist    70116

## Group by in pandas

In [89]:
##print(ratings_data.head(5))


grouped_data_by_userid = ratings_data.groupby('user_id') 

print(grouped_data_by_userid.count().head(5))
grouped_data_by_userid.count()['movie_id']

         movie_id  rating  unix_timestamp
user_id
1             272     272             272
2              62      62              62
3              54      54              54
4              24      24              24
5             175     175             175

user_id
1      272
2       62
3       54
4       24
5      175
6      211
7      403
8       59
9       22
10     184
11     181
12      51
13     636
14      98
15     104
16     140
17      28
18     277
19      20
20      48
21     179
22     128
23     151
24      68
25      78
26     107
27      25
28      79
29      34
30      43
      ...
914     23
915     26
916    317
917     35
918    103
919    217
920     26
921    110
922    127
923     74
924     82
925     32
926     20
927    120
928     32
929     49
930     63
931     61
932    241
933    184
934    174
935     39
936    142
937     40
938    108
939     49
940    107
941     22
942     79
943    168
Name: movie_id, Length: 943, dtype: int64

In [120]:
##getting average rating per movie
##print(ratings_data.head(5))


avg_ratings =ratings_data['rating'].groupby(ratings_data['movie_id']).mean()


avg_ratings.head(5)

movie_id
1    3.878319
2    3.206107
3    3.033333
4    3.550239
5    3.302326
Name: rating, dtype: float64

In [122]:
## name of movies with maximum average rating

max_rating=avg_ratings.max()

print(max_rating)

##print(avg_ratings)

good_movie_ids = avg_ratings[avg_ratings == max_rating].index
print(good_movie_ids)

##movies_data[movies_data.movie_id==good_movie_ids]

5.0
Int64Index([814, 1122, 1189, 1201, 1293, 1467, 1500, 1536, 1599, 1653], dtype='int64', name='movie_id')

In [123]:
##movie titles
movies_data[movies_data.movie_id.isin(good_movie_ids) ].title

813                         Great Day in Harlem, A (1994)
1121                       They Made Me a Criminal (1939)
1188                                   Prefontaine (1997)
1200           Marlene Dietrich: Shadow and Light (1996)
1292                                      Star Kid (1997)
1466                 Saint of Fort Washington, The (1993)
1499                            Santa with Muscles (1996)
1535                                 Aiqing wansui (1994)
1598                        Someone Else's America (1995)
1652    Entertaining Angels: The Dorothy Day Story (1996)
Name: title, dtype: object

In [128]:
##Average rating per user

ratings_data.head(5)


grouped_data = ratings_data['rating'].groupby(ratings_data['user_id'])

grouped_data.mean()


## other way

avg_rating = grouped_data.apply(lambda f:  f.mean())

avg_rating.head(5)

user_id
1    3.610294
2    3.709677
3    2.796296
4    4.333333
5    2.874286
Name: rating, dtype: float64